IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_udmachdes_regs.xml
<module id="UDMACHDES" HW_revision="" description="UDMACHDES Registers">
	<register id="DMASRCENDP" width="32" page="1" offset="0x0" internal="0" description="DMA Channel Source Address End Pointer">
		<bitfield id="ADDR" description="Source Address End Pointer" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMADSTENDP" width="32" page="1" offset="0x4" internal="0" description="DMA Channel Destination Address End Pointer">
		<bitfield id="ADDR" description="Destination Address End Pointer" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DMACHCTL" width="32" page="1" offset="0x8" internal="0" description="DMA Channel Control Word">
		<bitfield id="XFERMODE" description="DMA Transfer Mode" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="NXTUSEBURST" description="Next Useburst" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="XFERSIZE" description="Transfer Size (minus 1)" begin="13" end="4" width="10" rwaccess="RW"/>
		<bitfield id="ARBSIZE" description="Arbitration Size" begin="17" end="14" width="4" rwaccess="RW"/>
		<bitfield id="SRCPROT0" description="Source Privilege Access" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="DSTPROT0" description="Destination Privilege Access" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SRCSIZE" description="Source Data Size" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="SRCINC" description="Source Address Increment" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="DSTSIZE" description="Destination Data Size" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="DSTINC" description="Destination Address Increment" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
</module>
